In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
df=pd.read_excel("C:/Users/91629/Documents/decission_tree.xlsx")

In [4]:
df

        company                  job    degree  salary_more_than_100k
0        google       sale executive  bachelor                      0
1        google       sale executive   masters                      0
2        google    buisness manager   bachelor                      0
3        google    buisness manager    masters                      1
4        google  computer programmer  bachelor                      1
5        google  computer programmer   masters                      0
6   abc pharama       sale executive   masters                      1
7   abc pharama  computer programmer  bachelor                      0
8   abc pharama    buisness manager   bachelor                      0
9   abc pharama    buisness manager    masters                      1
10     facebook       sale executive  bachelor                      1
11     facebook       sale executive   masters                      1
12     facebook    buisness manager   bachelor                      1
13     facebook    buisness manager    masters                      1
14     facebook  computer programmer  bachelor                      1
15     facebook  computer programmer   masters                      1

In [5]:
df.head()

  company                  job    degree  salary_more_than_100k
0  google       sale executive  bachelor                      0
1  google       sale executive   masters                      0
2  google    buisness manager   bachelor                      0
3  google    buisness manager    masters                      1
4  google  computer programmer  bachelor                      1

In [9]:
inputs=df.drop('salary_more_than_100k',axis='columns')
target=df['salary_more_than_100k']

In [10]:
inputs

        company                  job    degree
0        google       sale executive  bachelor
1        google       sale executive   masters
2        google    buisness manager   bachelor
3        google    buisness manager    masters
4        google  computer programmer  bachelor
5        google  computer programmer   masters
6   abc pharama       sale executive   masters
7   abc pharama  computer programmer  bachelor
8   abc pharama    buisness manager   bachelor
9   abc pharama    buisness manager    masters
10     facebook       sale executive  bachelor
11     facebook       sale executive   masters
12     facebook    buisness manager   bachelor
13     facebook    buisness manager    masters
14     facebook  computer programmer  bachelor
15     facebook  computer programmer   masters

In [11]:
target

0     0
1     0
2     0
3     1
4     1
5     0
6     1
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_than_100k, dtype: int64

In [12]:
# here we wants to make a decission tree . here our target is to find out the person who have salary more than 100k.
# Now here Our target variable is salary_more_than_100k . So that 1st we drop down it and creat new variable target .Here we should change the other string type variable to float type.

In [17]:
from sklearn.preprocessing import LabelEncoder

In [19]:
#machine learning algorithm know only number so that we are using LabelEncoder to encode the variable

In [20]:
# As there are three coloumns so  that we should split it in three variable 
le_company=LabelEncoder()
le_job=LabelEncoder()
le_degree=LabelEncoder()

In [21]:
# Now we should creat extra columns in data_frame. here we creat extra columns in data frame 
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])

In [27]:
#drop the data company  and others from inputs sothat we are using the inputs.drop
inputs_n=inputs.drop(['company','job','degree'], axis='columns')

In [28]:
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [29]:
#google encoded as 2 abc pharama encoded as 1 and others are 0. similar for other variable

In [30]:
# now the data is ready for classification .
from sklearn import tree
# for decission tree we import tree from Sklearn

In [33]:
model= tree.DecisionTreeClassifier()

In [35]:
# now you train your model
model.fit(inputs_n, target)

DecisionTreeClassifier()

In [36]:
inputs_n,target

(    company_n  job_n  degree_n
 0           2      2         0
 1           2      2         1
 2           2      0         0
 3           2      0         1
 4           2      1         0
 5           2      1         1
 6           0      2         1
 7           0      1         0
 8           0      0         0
 9           0      0         1
 10          1      2         0
 11          1      2         1
 12          1      0         0
 13          1      0         1
 14          1      1         0
 15          1      1         1,
 0     0
 1     0
 2     0
 3     1
 4     1
 5     0
 6     1
 7     0
 8     0
 9     1
 10    1
 11    1
 12    1
 13    1
 14    1
 15    1
 Name: salary_more_than_100k, dtype: int64)

In [37]:
model.fit(inputs_n,target)

DecisionTreeClassifier()

In [38]:
# now  your model is ready to do classification. it is ready to check wheather your model is fit or not .
# here we does not split our data in two different part that is train or test because of its small size.
# now we should predict our data set whather our data set is good fit or not 
model.score(inputs_n,target)

1.0

In [39]:
# here we get the score 1 because we does not split the data and we can not make more difficult problem

In [42]:
# we are predicting the salary of that person who is working in google as a sale executive and have a bachaler drgree

model.predict([2,2,1])